# SetObjPropTxtVS

## Description
Set a text value to an extended property.

```pascal
FUNCTION SetObjPropTxtVS(
				PropertyID  : LONGINT;
				PropertyVal : DYNARRAY[] of CHAR): BOOLEAN;
```

```python
def vs.SetObjPropTxtVS(PropertyID, PropertyVal):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|PropertyID|LONGINT|   |
|PropertyVal|DYNARRAY[] of CHAR|   |

## Version
Availability: from Vectorworks 2017

## Category
* Object Events